Fekete19/ELIEH-ESP32-Voice-Control/ESP32A1S_API_KEY_V2_ful_git.ino
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <driver/i2s.h>
#include <time.h>

#include "ES8388.h"
#include "FS.h"
#include "SD_MMC.h"
#include "btn_fix.h"

// ====== CRT BUNDLE AUTO DETECT (Arduino core függő) ======
#if defined(__has_include)
  #if __has_include(<esp_crt_bundle.h>)
    #include <esp_crt_bundle.h>
    #define HAVE_CRT_BUNDLE 1
  #else
    #define HAVE_CRT_BUNDLE 0
  #endif
#else
  #define HAVE_CRT_BUNDLE 0
#endif

// =====================================================
// WIFI – FIX (ELIEH STANDARD)
// =====================================================
static const char* WIFI_SSID = "IDE A SAJÁT WI-FI SSID KELL";
static const char* WIFI_PASS = "IDE A HOZZÁ TARTOZO JELSZÓT";

// =====================================================
// OPENAI – kulcsot CSAK helyben írj be!
// =====================================================
static const char* OPENAI_API_KEY = " IDE A SAJÁT API KULCSOD MÁSOLD BE!";
static const char* OPENAI_HOST  = "api.openai.com";
static const char* OPENAI_PATH  = "/v1/audio/transcriptions";
static const int   OPENAI_PORT  = 443;
static const char* OPENAI_MODEL = "gpt-4o-transcribe";

// =====================================================
// TLS FALLBACK módok
//  - Ha van crt bundle: azt használjuk (stabil)
//  - Ha nincs crt bundle: ideiglenesen INSECURE, hogy működjön
//    (később core frissítéssel megoldjuk rendesen)
// =====================================================
static const bool ALLOW_INSECURE_TLS_WHEN_NO_BUNDLE = true;

// =====================================================
// AI Thinker AudioKit V2.2 pinek
// =====================================================
static const int PIN_I2S_MCLK = 0;
static const int PIN_I2S_BCK  = 27;
static const int PIN_I2S_WS   = 25;
static const int PIN_I2S_DOUT = 26;
static const int PIN_I2S_DIN  = 35;

static const int PIN_HP_DET   = 39;   // INPUT_PULLUP
static const int PIN_PA_EN    = 21;   // speaker amp enable

ES8388 es8388(33, 32, 400000); // SDA=33, SCL=32
static const i2s_port_t I2S_PORT = I2S_NUM_0;

// =====================================================
// GOMBOK (KEY2=GPIO13 KIESIK: SD DAT3)
// =====================================================
#define KEY1_PIN    36
#define KEY3_PIN    19
#define KEY4_PIN    23
#define KEY5_PIN    18
#define KEY6_PIN    5

#define BTN_MENU_PIN   KEY4_PIN
#define BTN_NEXT_PIN   KEY1_PIN
#define BTN_OK_PIN     KEY6_PIN
#define BTN_TEACH_PIN  KEY5_PIN

static const uint32_t DEBOUNCE_MS  = 35;
static const uint32_t LONGPRESS_MS = 650;

Btn btnMenu  { BTN_MENU_PIN,  true, true, true, 0, 0, false, false };
Btn btnNext  { BTN_NEXT_PIN,  true, true, true, 0, 0, false, false };
Btn btnOk    { BTN_OK_PIN,    true, true, true, 0, 0, false, false };
Btn btnTeach { BTN_TEACH_PIN, true, true, true, 0, 0, false, false };

// =====================================================
// MENÜ
// =====================================================
#define MENU_RUN     0
#define MENU_LEARN   1
#define MENU_COUNT   2
static int menuSel = MENU_RUN;

static const char* menuName(int m) {
  if (m == MENU_RUN)   return "VEGREHAJTAS (RUN)";
  if (m == MENU_LEARN) return "TANITAS (LEARN)";
  return "?";
}

static void printMenu() {
  Serial.println();
  Serial.println("===== ELIEH VOICE MENU =====");
  for (int i = 0; i < MENU_COUNT; i++) {
    Serial.print((i == menuSel) ? " > " : "   ");
    Serial.println(menuName(i));
  }
  Serial.println("----------------------------");
  Serial.println("MENU : menu kiiras");
  Serial.println("NEXT : menupont lepes");
  Serial.println("OK   : menupont info");
  Serial.println("TEACH: TANITAS (LEARN modban)");
  Serial.println("============================");
  Serial.println();
}

// =====================================================
// VAD paraméterek
// =====================================================
static const int   LEARN_MS      = 2500;
static float       TH_MULT      = 1.20f;
static int         TH_MARGIN    = 40;
static int         START_FRAMES = 2;
static int         END_FRAMES   = 10;

static const int SAMPLE_RATE   = 16000;
static const int FRAME_SAMPLES = 512;
static int16_t samples[FRAME_SAMPLES];

// preroll
static const int PREROLL_FRAMES = 6;
static int16_t preroll[PREROLL_FRAMES][FRAME_SAMPLES];
static int prerollIdx = 0;

// limitek
static const uint32_t MIN_SPEECH_BYTES = 6000;
static const uint32_t MAX_SPEECH_MS    = 8000;

static bool learned = false;
static int noiseRms = 0;
static int threshold = 0;
static uint32_t learnT0 = 0;
static int learnMaxRms = 0;

static bool speaking = false;
static int aboveCnt = 0;
static int belowCnt = 0;

static uint32_t speechStartMs = 0;

static uint32_t sttCooldownUntilMs = 0;
static uint32_t sttFailCount = 0;

// =====================================================
// SD fájlok
// =====================================================
static File wavFile;
static const char* WAV_PATH = "/rec.wav";
static uint32_t wavDataBytes = 0;

// TANÍTÁS MAP
static const char* MAP_FILE = "/voice_map.txt";
static const int MAX_MAP = 80;
static const int MAX_PHRASE = 96;
static const int MAX_LABEL  = 48;

struct MapItem {
  char phrase[MAX_PHRASE];
  char label[MAX_LABEL];
  bool used;
};
static MapItem mapItems[MAX_MAP];

static String pendingLabel = "";
static bool learnCaptureArmed = false;
static uint32_t teachArmMs = 0;

// =====================================================
// SEGÉDEK
// =====================================================
static bool headphoneConnected() { return digitalRead(PIN_HP_DET) == LOW; }
static void paPower(bool on) { digitalWrite(PIN_PA_EN, on ? HIGH : LOW); }

static String norm(const String& in) {
  String t = in;
  t.trim();
  t.toLowerCase();
  while (t.indexOf("  ") >= 0) t.replace("  ", " ");
  return t;
}

// =====================================================
// MAP kezelés
// =====================================================
static void clearMap() {
  for (int i = 0; i < MAX_MAP; i++) {
    mapItems[i].used = false;
    mapItems[i].phrase[0] = 0;
    mapItems[i].label[0] = 0;
  }
}

static int findByPhrase(const String& phrase) {
  String p = norm(phrase);
  for (int i = 0; i < MAX_MAP; i++) {
    if (!mapItems[i].used) continue;
    if (norm(String(mapItems[i].phrase)) == p) return i;
  }
  return -1;
}

