Fekete19/ELIEH-ESP32-Voice-Control/ESP32A1S_API_KEY_V2_ful_git.ino
static int firstFreeSlot() {
  for (int i = 0; i < MAX_MAP; i++) if (!mapItems[i].used) return i;
  return -1;
}

static bool addOrUpdateMap(const String& phraseIn, const String& labelIn) {
  String phrase = norm(phraseIn);
  String label  = norm(labelIn);
  if (phrase.length() < 2) return false;
  if (label.length()  < 2) return false;

  int idx = findByPhrase(phrase);
  if (idx < 0) {
    int slot = firstFreeSlot();
    if (slot < 0) return false;
    phrase.toCharArray(mapItems[slot].phrase, MAX_PHRASE);
    label.toCharArray(mapItems[slot].label, MAX_LABEL);
    mapItems[slot].used = true;
  } else {
    label.toCharArray(mapItems[idx].label, MAX_LABEL);
  }
  return true;
}

static void listMap() {
  Serial.println();
  Serial.println("---- TANITASOK LISTA (phrase -> label) ----");
  int c = 0;
  for (int i = 0; i < MAX_MAP; i++) {
    if (!mapItems[i].used) continue;
    Serial.print("  "); Serial.print(++c);
    Serial.print(") \""); Serial.print(mapItems[i].phrase);
    Serial.print("\"  ->  "); Serial.println(mapItems[i].label);
  }
  Serial.print("Osszesen: "); Serial.println(c);
  Serial.println("------------------------------------------");
  Serial.println();
}

static bool saveMapToSD() {
  if (SD_MMC.exists(MAP_FILE)) SD_MMC.remove(MAP_FILE);
  File f = SD_MMC.open(MAP_FILE, FILE_WRITE);
  if (!f) return false;

  f.println("# phrase|label");
  for (int i = 0; i < MAX_MAP; i++) {
    if (!mapItems[i].used) continue;
    f.print(mapItems[i].phrase); f.print("|"); f.println(mapItems[i].label);
  }
  f.close();
  return true;
}

static bool loadMapFromSD() {
  if (!SD_MMC.exists(MAP_FILE)) return false;
  File f = SD_MMC.open(MAP_FILE, FILE_READ);
  if (!f) return false;

  clearMap();
  while (f.available()) {
    String line = f.readStringUntil('\n');
    line.trim();
    if (!line.length() || line.startsWith("#")) continue;

    int p = line.indexOf('|');
    if (p < 0) continue;

    String phrase = line.substring(0, p); phrase.trim();
    String label  = line.substring(p + 1); label.trim();
    addOrUpdateMap(phrase, label);
  }
  f.close();
  return true;
}

// =====================================================
// RMS + PEAK
// =====================================================
static void calcFrameRmsPeak(const int16_t* buf, int &rms, int &peak) {
  int32_t p = 0;
  int64_t sumsq = 0;

  for (int i = 0; i < FRAME_SAMPLES; i++) {
    int32_t v = buf[i];
    int32_t av = (v < 0) ? -v : v;
    if (av > p) p = av;
    sumsq += (int64_t)v * (int64_t)v;
  }

  uint32_t mean = (uint32_t)(sumsq / FRAME_SAMPLES);

  // integer sqrt
  uint32_t x = mean, r = 0, bit = 1UL << 30;
  while (bit > x) bit >>= 2;
  while (bit != 0) {
    if (x >= r + bit) { x -= r + bit; r = (r >> 1) + bit; }
    else { r >>= 1; }
    bit >>= 2;
  }

  rms = (int)r;
  peak = (int)p;
}

// =====================================================
// I2S + ES8388 init
// =====================================================
static void setupMCLK() {
  PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO0_U, FUNC_GPIO0_CLK_OUT1);
  REG_WRITE(PIN_CTRL, 0xFFFFFFF0);
}

static void setupI2S() {
  i2s_config_t cfg = {};
  cfg.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX);
  cfg.sample_rate = SAMPLE_RATE;
  cfg.bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT;
  cfg.channel_format = I2S_CHANNEL_FMT_ONLY_RIGHT;

  // Arduino core kompatibilitás:
  // régi core: I2S_COMM_FORMAT_I2S / újabb: I2S_COMM_FORMAT_STAND_I2S
  #if defined(I2S_COMM_FORMAT_STAND_I2S)
    cfg.communication_format = I2S_COMM_FORMAT_STAND_I2S;
  #else
    cfg.communication_format = I2S_COMM_FORMAT_I2S;
  #endif

  cfg.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  cfg.dma_buf_count = 8;
  cfg.dma_buf_len   = 512;
  cfg.use_apll = false;
  cfg.tx_desc_auto_clear = true;
  cfg.fixed_mclk = 0;

  esp_err_t e = i2s_driver_install(I2S_PORT, &cfg, 0, NULL);
  Serial.print("[I2S] driver_install err="); Serial.println((int)e);

  i2s_pin_config_t pin_config = {};
  pin_config.bck_io_num   = PIN_I2S_BCK;
  pin_config.ws_io_num    = PIN_I2S_WS;
  pin_config.data_out_num = PIN_I2S_DOUT;
  pin_config.data_in_num  = PIN_I2S_DIN;

  e = i2s_set_pin(I2S_PORT, &pin_config);
  Serial.print("[I2S] set_pin err="); Serial.println((int)e);

  e = i2s_set_clk(I2S_PORT, SAMPLE_RATE, I2S_BITS_PER_SAMPLE_16BIT, I2S_CHANNEL_MONO);
  Serial.print("[I2S] set_clk err="); Serial.println((int)e);

  i2s_zero_dma_buffer(I2S_PORT);
  i2s_start(I2S_PORT);
}

static void setupES8388() {
  Serial.println("ES8388 init...");
  if (!es8388.init()) { Serial.println("ES8388 init FAIL"); return; }
  Serial.println("ES8388 init OK");

  es8388.inputSelect(IN2);
  es8388.setInputGain(8);

  es8388.outputSelect(OUT2);
  es8388.setOutputVolume(12);

  es8388.mixerSourceSelect(MIXADC, MIXADC);
  es8388.mixerSourceControl(SRCSELOUT);
  Serial.println("ES8388 ADC enabled");
}

// =====================================================
// WIFI + NTP (TLS-hez kell)
// =====================================================
static bool wifiConnect() {
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASS);

  Serial.print("WiFi csatlakozas");
  uint32_t t0 = millis();
  while (WiFi.status() != WL_CONNECTED) {
    delay(250);
    Serial.print(".");
    if (millis() - t0 > 15000) {
      Serial.println("\nWiFi TIMEOUT.");
      return false;
    }
  }
  Serial.println();
  Serial.print("WiFi OK, IP: ");
  Serial.println(WiFi.localIP());
  return true;
}

static bool syncTimeNTP() {
  configTime(0, 0, "pool.ntp.org", "time.nist.gov", "time.google.com");

  Serial.print("[TIME] NTP sync");
  uint32_t t0 = millis();
  time_t now = time(nullptr);

  while (now < 1700000000) {
    delay(250);
    Serial.print(".");
    now = time(nullptr);
    if (millis() - t0 > 15000) {
      Serial.println("\n[TIME] NTP TIMEOUT!");
      return false;
    }
  }

  Serial.println("\n[TIME] OK");
  struct tm t;
  gmtime_r(&now, &t);
  Serial.printf("[TIME] %04d-%02d-%02d %02d:%02d:%02d (UTC)\n",
                t.tm_year + 1900, t.tm_mon + 1, t.tm_mday,
                t.tm_hour, t.tm_min, t.tm_sec);
  return true;
}

