Fekete19/ELIEH-ESP32-Voice-Control/ESP32A1S_API_KEY_V2_ful_git.ino
// =====================================================
// SD init
// =====================================================
static bool sdInit() {
  if (!SD_MMC.begin("/sdcard", true)) {
    Serial.println("[SD] SD_MMC begin FAIL");
    return false;
  }
  uint64_t cardSize = SD_MMC.cardSize() / (1024ULL * 1024ULL);
  Serial.print("[SD] OK, size(MB)=");
  Serial.println((uint32_t)cardSize);
  return true;
}

// =====================================================
// WAV header
// =====================================================
static void wavWriteHeaderPlaceholder(File &f) {
  uint8_t h[44]; memset(h, 0, sizeof(h));
  h[0]='R'; h[1]='I'; h[2]='F'; h[3]='F';
  h[8]='W'; h[9]='A'; h[10]='V'; h[11]='E';
  h[12]='f'; h[13]='m'; h[14]='t'; h[15]=' ';
  h[16]=16; h[20]=1; h[22]=1;

  uint32_t sr = SAMPLE_RATE;
  h[24]= (uint8_t)(sr & 0xFF);
  h[25]= (uint8_t)((sr >> 8) & 0xFF);
  h[26]= (uint8_t)((sr >> 16) & 0xFF);
  h[27]= (uint8_t)((sr >> 24) & 0xFF);

  uint16_t bps = 16, ch = 1;
  uint32_t byteRate = sr * ch * (bps/8);
  h[28]= (uint8_t)(byteRate & 0xFF);
  h[29]= (uint8_t)((byteRate >> 8) & 0xFF);
  h[30]= (uint8_t)((byteRate >> 16) & 0xFF);
  h[31]= (uint8_t)((byteRate >> 24) & 0xFF);

  uint16_t blockAlign = ch * (bps/8);
  h[32]= (uint8_t)(blockAlign & 0xFF);
  h[33]= (uint8_t)((blockAlign >> 8) & 0xFF);

  h[34]= (uint8_t)(bps & 0xFF);
  h[35]= (uint8_t)((bps >> 8) & 0xFF);

  h[36]='d'; h[37]='a'; h[38]='t'; h[39]='a';
  f.write(h, 44);
}

static void wavFinalizeHeader(File &f, uint32_t dataBytes) {
  uint32_t riffSize = 36 + dataBytes;
  f.seek(4);  f.write((uint8_t*)&riffSize, 4);
  f.seek(40); f.write((uint8_t*)&dataBytes, 4);
  f.seek(0, SeekEnd);
}

// =====================================================
// VAD reset
// =====================================================
static void vadResetLearn() {
  learned = false;
  noiseRms = 0;
  threshold = 0;
  learnT0 = millis();
  learnMaxRms = 0;

  speaking = false;
  aboveCnt = 0;
  belowCnt = 0;

  Serial.println("[VAD] Zajtanulas ujrainditva...");
}

// =====================================================
// TLS config helper
// =====================================================
// =====================================================
// TLS config helper (CORE-KOMPATIBILIS)
// =====================================================
static void applyTlsConfig(WiFiClientSecure &client) {
  client.setTimeout(35);
  client.setHandshakeTimeout(35);

#if HAVE_CRT_BUNDLE
  Serial.println("[TLS] CRT bundle: ON");
  client.setCACertBundle(esp_crt_bundle_attach);

#else
  Serial.println("[TLS] CRT bundle: NINCS");

  if (ALLOW_INSECURE_TLS_WHEN_NO_BUNDLE) {
    Serial.println("[TLS] FIGYELEM: ideiglenes INSECURE TLS (teszt)!");

    // ESP32 Arduino core 3.x környékén már jellemzően van setInsecure()
    #if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
      client.setInsecure();
    #else
      client.setCACert(nullptr);
    #endif

  } else {
    Serial.println("[TLS] Nincs CA -> TLS nem fog menni.");
  }
#endif
}

// =====================================================
// OpenAI STT (WAV -> text)
// =====================================================
static String openaiTranscribeWav(const char* pathOnSd) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[STT] Nincs WiFi.");
    return "";
  }
    if (millis() < sttCooldownUntilMs) {
  Serial.print("[STT] Cooldown aktiv, varj meg ennyit (ms): ");
  Serial.println(sttCooldownUntilMs - millis());
  return "";
}
  if (strlen(OPENAI_API_KEY) < 20) {
    Serial.println("[STT] Nincs API kulcs beallitva.");
    return "";
  }

  File f = SD_MMC.open(pathOnSd, FILE_READ);
  if (!f) {
    Serial.println("[STT] WAV file megnyitas FAIL.");
    return "";
  }

  IPAddress ip;
  if (!WiFi.hostByName(OPENAI_HOST, ip)) {
    Serial.println("[STT] DNS FAIL (hostByName)");
    f.close();
    return "";
  }
  Serial.print("[STT] OPENAI IP: ");
  Serial.println(ip);

  String boundary = "----EliehBoundary7MA4YWxkTrZu0gW";
  String head =
    String("--") + boundary + "\r\n" +
    "Content-Disposition: form-data; name=\"model\"\r\n\r\n" +
    String(OPENAI_MODEL) + "\r\n" +
    String("--") + boundary + "\r\n" +
    "Content-Disposition: form-data; name=\"response_format\"\r\n\r\n" +
    "text\r\n" +
    String("--") + boundary + "\r\n" +
    "Content-Disposition: form-data; name=\"file\"; filename=\"rec.wav\"\r\n" +
    "Content-Type: audio/wav\r\n\r\n";

  String tail = "\r\n--" + boundary + "--\r\n";

  uint32_t fileSize = (uint32_t)f.size();
  uint32_t contentLength = head.length() + fileSize + tail.length();

  WiFiClientSecure client;
  applyTlsConfig(client);

  Serial.println("[STT] Kapcsolodas OpenAI...");
  if (!client.connect(OPENAI_HOST, OPENAI_PORT)) {
    Serial.println("[STT] connect FAIL (TLS)");
    f.close();
    return "";
  }

  client.print(String("POST ") + OPENAI_PATH + " HTTP/1.1\r\n");
  client.print(String("Host: ") + OPENAI_HOST + "\r\n");
  client.print("User-Agent: Elieh-A1S\r\n");
  client.print(String("Authorization: Bearer ") + OPENAI_API_KEY + "\r\n");
  client.print(String("Content-Type: multipart/form-data; boundary=") + boundary + "\r\n");
  client.print(String("Content-Length: ") + contentLength + "\r\n");
  client.print("Connection: close\r\n\r\n");

  client.print(head);

  uint8_t buf[1024];
  while (f.available()) {
    int n = f.read(buf, sizeof(buf));
    if (n > 0) client.write(buf, n);
    delay(0);
  }
  f.close();

  client.print(tail);

  String resp;
  uint32_t t0 = millis();
  while (client.connected() && (millis() - t0 < 30000)) {
    while (client.available()) {
      resp += (char)client.read();
      t0 = millis();
    }
    delay(5);
  }
  client.stop();

  int pLineEnd = resp.indexOf("\r\n");
  if (pLineEnd > 0) {
    String statusLine = resp.substring(0, pLineEnd);
    Serial.print("[STT] HTTP: ");
    Serial.println(statusLine);
  }

  int bodyPos = resp.indexOf("\r\n\r\n");
String body = (bodyPos >= 0) ? resp.substring(bodyPos + 4) : resp;
body.trim();
Serial.print("[STT] body len = ");
Serial.println(body.length());
Serial.println("[STT] body (elso 200):");
Serial.println(body.substring(0, min(200, (int)body.length())));
    
// ---- HTTP status code kinyerése ----
int httpCode = 0;
int sp1 = resp.indexOf(' ');
if (sp1 > 0) {
  int sp2 = resp.indexOf(' ', sp1 + 1);
  if (sp2 > sp1) {
    httpCode = resp.substring(sp1 + 1, sp2).toInt();
  }
}

if (httpCode == 429) {
  // 429 lehet rate-limit vagy insufficient_quota – nálad QUOTA
  Serial.println("[STT] 429 -> tul sok / quota / billing hiba.");
  Serial.println("[STT] Valasz (JSON/hiba):");
  Serial.println(body);

  // ha quota, akkor hosszabb cooldown, hogy ne spam-eljünk
  if (body.indexOf("insufficient_quota") >= 0) {
    sttCooldownUntilMs = millis() + 5UL * 60UL * 1000UL; // 5 perc
    Serial.println("[STT] INSUFFICIENT_QUOTA: 5 perc cooldown.");
  } else {
    sttCooldownUntilMs = millis() + 30UL * 1000UL; // 30 mp
    Serial.println("[STT] RATE LIMIT: 30s cooldown.");
  }

  sttFailCount++;
  return "";
}

if (httpCode >= 400) {
  Serial.print("[STT] HTTP HIBA: "); Serial.println(httpCode);
  Serial.println("[STT] Valasz:");
  Serial.println(body);

  // rövid cooldown a többi hibára is
  sttCooldownUntilMs = millis() + 20UL * 1000UL;
  sttFailCount++;
  return "";
}

