Fekete19/ELIEH-ESP32-Voice-Control/ESP32A1S_API_KEY_V2_ful_git.ino
// Ha JSON, még lehet error
if (body.startsWith("{") && body.indexOf("\"error\"") >= 0) {
  Serial.println("[STT] JSON error valasz:");
  Serial.println(body);
  sttFailCount++;
  sttCooldownUntilMs = millis() + 20UL * 1000UL;
  return "";
}

sttFailCount = 0;
return body;
}
// =====================================================
// “Végrehajtás”
// =====================================================
static void executeLabel(const String& label) {
  Serial.print("[VEGREHAJTAS] ");
  Serial.println(label);
  Serial.println("[STATUS] VEGREHAJTOTTA.");
}

// =====================================================
// Audio frame feldolgozás
// =====================================================
static void processAudioFrame() {
  if (menuSel == MENU_LEARN && learnCaptureArmed) {
    if (millis() - teachArmMs > 12000) {
      learnCaptureArmed = false;
      Serial.println("[TANITAS] TEACH timeout (nem beszeltel).");
    }
  }

  size_t bytesRead = 0;
  esp_err_t e = i2s_read(I2S_PORT, (void*)samples, sizeof(samples), &bytesRead, 200 / portTICK_PERIOD_MS);
  if (e != ESP_OK || bytesRead != sizeof(samples)) {
    static uint32_t last = 0;
    if (millis() - last > 1200) {
      last = millis();
      Serial.print("[I2S] read err="); Serial.print((int)e);
      Serial.print(" bytes="); Serial.println((int)bytesRead);
    }
    return;
  }

  memcpy(preroll[prerollIdx], samples, sizeof(samples));
  prerollIdx = (prerollIdx + 1) % PREROLL_FRAMES;

  int rms = 0, peak = 0;
  calcFrameRmsPeak(samples, rms, peak);

  if (!learned) {
    if (rms > learnMaxRms) learnMaxRms = rms;

    if (millis() - learnT0 >= (uint32_t)LEARN_MS) {
      learned = true;
      noiseRms = learnMaxRms;
      threshold = (int)(noiseRms * TH_MULT) + TH_MARGIN;

      Serial.print("[VAD] Zaj RMS tanult="); Serial.println(noiseRms);
      Serial.print("[VAD] Kuszob TH="); Serial.println(threshold);
      Serial.println("[VAD] Most beszelhetsz.");
    }
    return;
  }

  bool above = (rms > threshold) || (peak > threshold);
  if (above) { aboveCnt++; belowCnt = 0; }
  else       { belowCnt++; aboveCnt = 0; }

  bool wantRecordNow =
    (menuSel == MENU_RUN) ||
    (menuSel == MENU_LEARN && learnCaptureArmed);

  if (!speaking && wantRecordNow && aboveCnt >= START_FRAMES) {
    speaking = true;
    speechStartMs = millis();
    wavDataBytes = 0;

    if (SD_MMC.exists(WAV_PATH)) SD_MMC.remove(WAV_PATH);
    wavFile = SD_MMC.open(WAV_PATH, FILE_WRITE);
    if (!wavFile) {
      Serial.println("[WAV] open FAIL");
      speaking = false;
      return;
    }
    wavWriteHeaderPlaceholder(wavFile);

    for (int k = 0; k < PREROLL_FRAMES; k++) {
      int idx = (prerollIdx + k) % PREROLL_FRAMES;
      size_t w = wavFile.write((uint8_t*)preroll[idx], sizeof(preroll[idx]));
      wavDataBytes += (uint32_t)w;
    }

    if (menuSel == MENU_LEARN) Serial.println(">>> TANITAS BESZED INDUL (WAV mentes)");
    else                       Serial.println(">>> BESZED INDUL (WAV mentes SD-re)");
  }

  if (speaking) {
    size_t w = wavFile.write((uint8_t*)samples, sizeof(samples));
    wavDataBytes += (uint32_t)w;

    if (millis() - speechStartMs > MAX_SPEECH_MS) {
      belowCnt = END_FRAMES;
    }
  }

  if (speaking && belowCnt >= END_FRAMES) {
    speaking = false;

    if (wavFile) {
      wavFinalizeHeader(wavFile, wavDataBytes);
      wavFile.close();
    }

    Serial.print("<<< BESZED VEGE, wav bytes=");
    Serial.println(wavDataBytes);

    if (wavDataBytes < MIN_SPEECH_BYTES) {
      Serial.println("[WAV] Tul rovid / ures, eldobva.");
      if (menuSel == MENU_LEARN && learnCaptureArmed) {
        learnCaptureArmed = false;
        Serial.println("[TANITAS] NINCS ELTAROLVA (rovid hang).");
      }
      return;
    }

    String text = openaiTranscribeWav(WAV_PATH);
    text = norm(text);

    if (text.length() < 2) {
  Serial.println("[STT] Nincs szoveg. (Valoszinuleg quota/rate-limit/billing vagy halo).");
  if (menuSel == MENU_LEARN && learnCaptureArmed) {
    learnCaptureArmed = false;
    Serial.println("[TANITAS] NINCS ELTAROLVA (STT hiba / quota).");
  }
  return;
}

    Serial.println("[STT TEXT]");
    Serial.println(text);

    if (menuSel == MENU_LEARN && learnCaptureArmed) {
      learnCaptureArmed = false;

      if (pendingLabel.length() < 2) {
        Serial.println("[TANITAS] NINCS ELTAROLVA (nincs beirt cimke).");
        return;
      }

      bool ok = addOrUpdateMap(text, pendingLabel);
      if (ok) {
        bool saved = saveMapToSD();
        Serial.print("[TANITAS] ELTAROLVA: \"");
        Serial.print(text);
        Serial.print("\" -> ");
        Serial.println(pendingLabel);
        Serial.println(saved ? "[SD] Mentve." : "[SD] Mentes HIBA!");
        listMap();
      } else {
        Serial.println("[TANITAS] NINCS ELTAROLVA (nincs hely / hibas adat).");
      }
      return;
    }

    if (menuSel == MENU_RUN) {
      int idx = findByPhrase(text);
      if (idx >= 0) {
        Serial.print("[FELISMERES] OK: ");
        Serial.print(text);
        Serial.print(" -> ");
        Serial.println(mapItems[idx].label);
        executeLabel(String(mapItems[idx].label));
      } else {
        Serial.print("[FELISMERES] NEM FELISMERHETO: ");
        Serial.println(text);
      }
    }
  }
}

// =====================================================
// SOROS parancsok
// =====================================================
static void printHelp() {
  Serial.println();
  Serial.println("=== SOROS PARANCSOK ===");
  Serial.println("Beirt sor (pl: konyha be) -> cimke (pendingLabel)");
  Serial.println("LIST  -> tanitasok listazasa");
  Serial.println("CLEAR -> osszes tanitas torlese (memoria+SD)");
  Serial.println("HELP  -> ez");
  Serial.println("=======================");
  Serial.println();
}

static String serialLine;

static void pollSerial() {
  while (Serial.available()) {
    char c = (char)Serial.read();
    if (c == '\n' || c == '\r') {
      if (serialLine.length() > 0) {
        String line = serialLine;
        serialLine = "";
        line.trim();
        if (line.length() == 0) return;

        if (line.equalsIgnoreCase("HELP")) { printHelp(); return; }
        if (line.equalsIgnoreCase("LIST")) { listMap(); return; }

        if (line.equalsIgnoreCase("CLEAR")) {
          clearMap();
          if (SD_MMC.exists(MAP_FILE)) SD_MMC.remove(MAP_FILE);
          Serial.println("[CLEAR] Tanitasok torolve (memoria+SD).");
          return;
        }

        pendingLabel = norm(line);
        Serial.print("[CIMKE] Beallitva: ");
        Serial.println(pendingLabel);
        Serial.println("[TANITAS] LEARN modban nyomd meg a TEACH gombot, majd mondd ki a parancsot.");
      }
    } else {
      serialLine += c;
      if (serialLine.length() > 200) serialLine.remove(0, 80);
    }
  }
}

