Fekete19/ELIEH-ESP32-Voice-Control/ESP32A1S_API_KEY_V2_ful_git.ino
// =====================================================
// SETUP / LOOP
// =====================================================
void setup() {
  Serial.begin(115200);
  delay(800);

  pinMode(PIN_PA_EN, OUTPUT);
  digitalWrite(PIN_PA_EN, LOW);
  pinMode(PIN_HP_DET, INPUT_PULLUP);

  btnInit(btnMenu);
  btnInit(btnNext);
  btnInit(btnOk);
  btnInit(btnTeach);

  Serial.println();
  Serial.println("=== ELIEH A1S VOICE v2.4 (COMPAT + TLS FIX) ===");

  bool wifiOk = wifiConnect();
  if (wifiOk) {
    syncTimeNTP();
  } else {
    Serial.println("[WIFI] Nincs WiFi -> STT nem fog menni.");
  }

  if (!sdInit()) {
    Serial.println("[SD] Nincs SD, tanitas/mentes nem fog menni rendesen.");
  } else {
    bool ok = loadMapFromSD();
    Serial.println(ok ? "[SD] Tanitasok betoltve." : "[SD] Nincs mentett tanitas (vagy ures).");
  }

  setupMCLK();
  setupI2S();
  setupES8388();

  printHelp();
  printMenu();

  vadResetLearn();

  Serial.println("[I2S] teszt olvasas...");
  size_t br=0;
  int16_t tmp[256];
  esp_err_t e = i2s_read(I2S_PORT, tmp, sizeof(tmp), &br, 200 / portTICK_PERIOD_MS);
  Serial.print("[I2S] test err="); Serial.print((int)e);
  Serial.print(" bytes="); Serial.println((int)br);

  if (menuSel == MENU_RUN) {
    Serial.println("[RUN] Eddigi tanitasok:");
    listMap();
  }
}

void loop() {
  pollSerial();

  static bool lastPA = false;
  bool wantPA = !headphoneConnected();
  if (wantPA != lastPA) {
    lastPA = wantPA;
    paPower(wantPA);
    Serial.print("[AUDIO] PA=");
    Serial.println(wantPA ? "ON" : "OFF");
  }

  btnUpdate(btnMenu,  DEBOUNCE_MS, LONGPRESS_MS);
  btnUpdate(btnNext,  DEBOUNCE_MS, LONGPRESS_MS);
  btnUpdate(btnOk,    DEBOUNCE_MS, LONGPRESS_MS);
  btnUpdate(btnTeach, DEBOUNCE_MS, LONGPRESS_MS);

  if (btnPressed(btnMenu)) {
    printMenu();
    if (menuSel == MENU_RUN) listMap();
    if (menuSel == MENU_LEARN) {
      Serial.println("[LEARN] Irj be soroson egy cimket (pl: konyha be), majd TEACH, es mondd ki.");
    }
  }

  if (btnPressed(btnNext)) {
    menuSel++;
    if (menuSel >= MENU_COUNT) menuSel = 0;
    printMenu();
    if (menuSel == MENU_RUN) {
      Serial.println("[RUN] Eddigi tanitasok:");
      listMap();
    }
    if (menuSel == MENU_LEARN) {
      Serial.println("[LEARN] Irj be soroson egy cimket, majd TEACH.");
    }
  }

  if (btnPressed(btnOk)) {
    Serial.print("[MENU] Kivalasztva: ");
    Serial.println(menuName(menuSel));
    if (menuSel == MENU_RUN) {
      Serial.println("[RUN] Beszelj, felismeres indul.");
      listMap();
    } else if (menuSel == MENU_LEARN) {
      Serial.println("[LEARN] Cimke most: " + pendingLabel);
      Serial.println("[LEARN] Nyomd meg TEACH-et a tanitashoz.");
    }
  }

  if (btnPressed(btnTeach)) {
    if (menuSel != MENU_LEARN) {
      Serial.println("[TANITAS] Csak LEARN modban mukodik.");
    } else if (pendingLabel.length() < 2) {
      Serial.println("[TANITAS] Elobb irj be soroson egy cimket (pl: konyha be)!");
    } else {
      Serial.print("[TANITAS] TEACH ARM. Cimke: ");
      Serial.println(pendingLabel);
      Serial.println("[TANITAS] Most mondd ki a parancsot (VAD indul) ...");

      learnCaptureArmed = true;
      teachArmMs = millis();

      speaking = false;
      aboveCnt = 0;
      belowCnt = 0;
    }
  }

  processAudioFrame();
}
